import { EventType } from "../types/event.types";

export const events: EventType[] = [
  {
    name: "Наука",
    dates: [
      {
        year: 2015,
        description:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды.",
      },
      {
        year: 2016,
        description:
          "Телескоп «Хаббл» обнаружил самую удалённую галактику GN-z11, расстояние до которой составляет 13,4 миллиарда световых лет.",
      },
      {
        year: 2018,
        description:
          "Запуск зонда Parker Solar Probe для изучения солнечной короны, он стал самым быстрым космическим аппаратом в истории.",
      },
      {
        year: 2020,
        description:
          "Учёные объявили об открытии фосфина в атмосфере Венеры, что может быть признаком существования жизни.",
      },
      {
        year: 2023,
        description:
          "Создание первого в мире искусственного эмбриона без использования сперматозоидов, яйцеклеток и матки.",
      },
    ],
  },
  {
    name: "Технологии",
    dates: [
      {
        year: 2017,
        description:
          "Телескоп «Хаббл» обнаружил самую удалённую галактику GN-z11Телескоп «Хаббл» обнаружил самую удалённую галактику GN-z11Телескоп «Хаббл» обнаружил самую удалённую галактику GN-z11Телескоп «Хаббл» обнаружил самую удалённую галактику GN-z11Телескоп «Хаббл» обнаружил самую удалённую галактику GN-z11Телескоп «Хаббл» обнаружил самую удалённую галактику GN-z11Телескоп «Хаббл» обнаружил самую удалённую галактику GN-z11Компания Tesla представила электрический грузовик Tesla Semi, который может проехать до 800 км на одном заряде.",
      },
      {
        year: 2018,
        description:
          "Илон Маск продемонстрировал подземный тоннель для транспортной системы Hyperloop в Лос-Анджелесе.",
      },
      {
        year: 2020,
        description:
          "SpaceX успешно запустила миссию Crew Dragon, доставив астронавтов на Международную космическую станцию.",
      },
      {
        year: 2022,
        description:
          "Великобритания запустила первый в мире термоядерный реактор, работающий в режиме устойчивого удержания плазмы.",
      },
      {
        year: 2023,
        description:
          "Apple выпустила первые очки дополненной реальности Vision Pro с революционной технологией управления жестами.",
      },
    ],
  },
  {
    name: "История",
    dates: [
      {
        year: 1989,
        description:
          "Падение Берлинской стены, что ознаменовало конец Холодной войны и объединение Германии.",
      },
      {
        year: 1969,
        description:
          "Первый человек высадился на Луну в рамках миссии NASA Apollo 11, это был Нил Армстронг.",
      },
      {
        year: 1991,
        description:
          "Распад СССР, что привело к образованию 15 независимых государств.",
      },
      {
        year: 2001,
        description:
          "11 сентября — атака террористов на Всемирный торговый центр в Нью-Йорке, изменившая мировую политику безопасности.",
      },
      {
        year: 2010,
        description:
          "Начало Арабской весны, серии антиправительственных протестов на Ближнем Востоке и в Северной Африке.",
      },
      {
        year: 2022,
        description:
          "Елизавета II скончалась, завершив самое продолжительное правление в истории британской монархии.",
      },
    ],
  },
  {
    name: "Культура",
    dates: [
      {
        year: 1997,
        description:
          "Выход книги «Гарри Поттер и философский камень», положившей начало культовой серии Дж. К. Роулинг.",
      },
      {
        year: 2009,
        description:
          "Фильм «Аватар» Джеймса Кэмерона стал самым кассовым фильмом в истории кинематографа на тот момент.",
      },
      {
        year: 2021,
        description:
          "Премьера сериала «Игра в кальмара», ставшего самым популярным шоу Netflix за всю историю платформы.",
      },
      {
        year: 1985,
        description:
          "Создание культового музыкального хита «We Are the World», записанного для благотворительности.",
      },
      {
        year: 2001,
        description:
          "Выход первого фильма трилогии «Властелин колец» режиссёра Питера Джексона.",
      },
    ],
  },
  {
    name: "Экология",
    dates: [
      {
        year: 1987,
        description:
          "Подписание Монреальского протокола для защиты озонового слоя от разрушения.",
      },
      {
        year: 2015,
        description:
          "Заключение Парижского соглашения, направленного на борьбу с глобальным потеплением.",
      },
      {
        year: 2020,
        description:
          "Мировая выбросы CO2 временно снизились на 7% из-за пандемии COVID-19.",
      },
      {
        year: 2006,
        description:
          "Выход фильма «Неудобная правда» Альберта Гора, привлекшего внимание к проблеме изменения климата.",
      },
      {
        year: 2022,
        description:
          "Глобальный саммит COP27 в Египте, посвящённый климатическим изменениям и устойчивому развитию.",
      },
    ],
  },
];
